
int menu();//головне меню
void add();//додавання товару до бази
void save();//запис даних про товари у файл
void print();//виведення даних про товари на екран
void read_file();//читання даних про товари з файлу

int make_order();//логіка меню "зробити замовлення"
int menu_order();//відображення меню "зробити замовлення"
void add_order();//додавання товару у кошик
void save_order();//збрігання замовлення
void print_order();//виведення замовлення на екран
void del_order();//видалення замовлення
void check();//виведення чеку на екран

void edit();//виклик меню "редагування"
int menu_edit_product();//логіка меню "редагування"
int menu_edit();//відображення меню "редагування" 
void edit_name();//редагування назви продуктів
void edit_grup();//редагування групи продуктів
void edit_validity();//редагування терміну придатності продуктів
void edit_num();//редагування кількості продуктів
void edit_price();//редагування ціни продуктів
void edit_del();//видалення поелементно даних з файлу
void edit_del_sort();//видалення відсортованих елементів з файлу по терміну придатності 
void edit_formatting();//форматування даних у файлі про товари
void edit_formatting_order();//форматування даних у файлі про чеки

int sort();//виклик меню "сортування"
int menu_sort();//логіка меню "сортування"
void sort_name();//сортування в алфавітному порядку назви товарів
void sort_group();//сортування в алфавітному порядку групи товарів
void sort_numb();//сортування по зростаню кількості товарів
void sort_val();//сортування по зростаню терміну тридатності товарів
void sort_pra();//сортування по зростаню ціни товарів
void print_grup();//відображення даних про товари відповідної групи
